const failedCitiesWithNeighbors = {
    "서울특별시": {
      "강북구": ["성북구", "도봉구"],
      "마포구": ["서대문구", "은평구"]
    },
    "부산광역시": {
      "사하구": ["서구", "강서구"],
      "금정구": ["동래구", "북구"],
      "강서구": ["사하구", "북구"]
    },
    "경기도": {
      "의왕시": ["안양시", "과천시"],
      "하남시": ["성남시", "광주시"],
      "동두천시": ["양주시", "연천군"],
      "과천시": ["안양시", "성남시"],
      "가평군": ["남양주시", "양평군"]
    },
    "강원도": {
      "춘천시": ["홍천군", "양구군"],
      "원주시": ["횡성군", "평창군"],
      "강릉시": ["동해시", "양양군"],
      "동해시": ["삼척시", "강릉시"],
      "태백시": ["정선군", "삼척시"],
      "속초시": ["양양군", "고성군"],
      "삼척시": ["동해시", "태백시"],
      "홍천군": ["춘천시", "횡성군"],
      "횡성군": ["원주시", "영월군"],
      "영월군": ["평창군", "정선군"],
      "평창군": ["원주시", "영월군"],
      "정선군": ["태백시", "영월군"],
      "철원군": ["화천군", "양구군"],
      "화천군": ["춘천시", "양구군"],
      "양구군": ["춘천시", "인제군"],
      "인제군": ["양양군", "고성군"],
      "고성군": ["속초시", "양양군"],
      "양양군": ["속초시", "강릉시"]
    },
    "충청북도": {
      "증평군": ["청주시", "괴산군"],
      "음성군": ["충주시", "괴산군"],
      "단양군": ["제천시", "영월군"]
    },
    "충청남도": {
      "계룡시": ["공주시", "논산시"],
      "금산군": ["논산시", "공주시"]
    },
    "전라북도": {
      "전주시": ["익산시", "완주군"],
      "군산시": ["익산시", "김제시"],
      "익산시": ["군산시", "김제시"],
      "정읍시": ["고창군", "부안군"],
      "남원시": ["장수군", "임실군"],
      "김제시": ["익산시", "정읍시"],
      "완주군": ["전주시", "진안군"],
      "진안군": ["완주군", "무주군"],
      "무주군": ["진안군", "장수군"],
      "장수군": ["무주군", "남원시"],
      "임실군": ["순창군", "남원시"],
      "순창군": ["임실군", "정읍시"],
      "고창군": ["정읍시", "부안군"],
      "부안군": ["고창군", "정읍시"]
    },
    "전라남도": {
      "함평군": ["영광군", "무안군"]
    },
    "경상북도": {
      "군위군": ["의성군", "안동시"],
      "영양군": ["청송군", "영덕군"],
      "영덕군": ["영양군", "울진군"],
      "성주군": ["고령군", "칠곡군"],
      "칠곡군": ["구미시", "성주군"],
      "봉화군": ["영주시", "안동시"]
    },
    "경상남도": {
      "함안군": ["창녕군", "의령군"],
      "하동군": ["사천시", "남해군"]
    },
    "제주특별자치도": {
      "서귀포시": ["제주시"]
    }
  };
  
  module.exports = { failedCitiesWithNeighbors };